# GetVPLrOvrdCount

## Description
Retrieves the number of layer overrides.

```pascal
FUNCTION GetVPLrOvrdCount(viewportHandle : HANDLE): INTEGER;
```

```python
def vs.GetVPLrOvrdCount(viewportHandle):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The viewport handle.|

## See Also
VS Functions:
GetVPLrOvrdHandle

## Version
Availability: from Vectorworks 2014

## Category
* Viewports